#Arjun Ajeesh
#USN:21BTRCD005

In [3]:
import pandas as pd
import numpy as np

In [4]:
#Creating a dataset of house

data = {'Rooms': [1,1,2,2,3,3,np.nan, 4],
        'Bathrooms': [1,2,1,2,2,3,2, np.nan],
        'Square_Footage': [800, 900, 1000, 1200, 1400, 1500, 1700, 2100],
        'Neighborhood': ['rural','rural','urban','rural','urban','urban','urban','rural'],
        'Year_Built': [1991, 2004, 1994, 2002, 2003, 1989, np.nan, 2012],
        'Price': [3000000, 3500000, 4500000, 5000000, 6500000, 7000000, 8000000, np.nan]}

In [5]:
house_data = pd.DataFrame(data)

In [6]:
house_data

   Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price
0    1.0        1.0             800        rural      1991.0  3000000.0
1    1.0        2.0             900        rural      2004.0  3500000.0
2    2.0        1.0            1000        urban      1994.0  4500000.0
3    2.0        2.0            1200        rural      2002.0  5000000.0
4    3.0        2.0            1400        urban      2003.0  6500000.0
5    3.0        3.0            1500        urban      1989.0  7000000.0
6    NaN        2.0            1700        urban         NaN  8000000.0
7    4.0        NaN            2100        rural      2012.0        NaN

print(house_data)

#removing rows with missing values

In [7]:
house_data.dropna()

   Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price
0    1.0        1.0             800        rural      1991.0  3000000.0
1    1.0        2.0             900        rural      2004.0  3500000.0
2    2.0        1.0            1000        urban      1994.0  4500000.0
3    2.0        2.0            1200        rural      2002.0  5000000.0
4    3.0        2.0            1400        urban      2003.0  6500000.0
5    3.0        3.0            1500        urban      1989.0  7000000.0

nan values

In [8]:

house_data.dropna(thresh=2)

   Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price
0    1.0        1.0             800        rural      1991.0  3000000.0
1    1.0        2.0             900        rural      2004.0  3500000.0
2    2.0        1.0            1000        urban      1994.0  4500000.0
3    2.0        2.0            1200        rural      2002.0  5000000.0
4    3.0        2.0            1400        urban      2003.0  6500000.0
5    3.0        3.0            1500        urban      1989.0  7000000.0
6    NaN        2.0            1700        urban         NaN  8000000.0
7    4.0        NaN            2100        rural      2012.0        NaN

# replacing missing values in the Rooms column with the mean of the column

In [9]:

house_data['Rooms'].fillna(house_data['Rooms'].mean(), inplace=True)

In [10]:
print(house_data)

      Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price
0  1.000000        1.0             800        rural      1991.0  3000000.0
1  1.000000        2.0             900        rural      2004.0  3500000.0
2  2.000000        1.0            1000        urban      1994.0  4500000.0
3  2.000000        2.0            1200        rural      2002.0  5000000.0
4  3.000000        2.0            1400        urban      2003.0  6500000.0
5  3.000000        3.0            1500        urban      1989.0  7000000.0
6  2.285714        2.0            1700        urban         NaN  8000000.0
7  4.000000        NaN            2100        rural      2012.0        NaN

In [11]:
house_data['Bathrooms'].fillna(house_data['Bathrooms'].median(), inplace=True)

In [12]:
print(house_data)

      Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price
0  1.000000        1.0             800        rural      1991.0  3000000.0
1  1.000000        2.0             900        rural      2004.0  3500000.0
2  2.000000        1.0            1000        urban      1994.0  4500000.0
3  2.000000        2.0            1200        rural      2002.0  5000000.0
4  3.000000        2.0            1400        urban      2003.0  6500000.0
5  3.000000        3.0            1500        urban      1989.0  7000000.0
6  2.285714        2.0            1700        urban         NaN  8000000.0
7  4.000000        2.0            2100        rural      2012.0        NaN

# replacing categorical values with numeric data

In [13]:

house_data['Neighborhood'] = house_data['Neighborhood'].replace({'rural': 1, 'urban': 2})

In [14]:
print(house_data)

      Rooms  Bathrooms  Square_Footage  Neighborhood  Year_Built      Price
0  1.000000        1.0             800             1      1991.0  3000000.0
1  1.000000        2.0             900             1      2004.0  3500000.0
2  2.000000        1.0            1000             2      1994.0  4500000.0
3  2.000000        2.0            1200             1      2002.0  5000000.0
4  3.000000        2.0            1400             2      2003.0  6500000.0
5  3.000000        3.0            1500             2      1989.0  7000000.0
6  2.285714        2.0            1700             2         NaN  8000000.0
7  4.000000        2.0            2100             1      2012.0        NaN

# converting Neighborhood column to a categorical data type

In [15]:

house_data['Neighborhood'] = house_data['Neighborhood'].astype('category')

In [16]:
print(house_data.dtypes)

Rooms              float64
Bathrooms          float64
Square_Footage       int64
Neighborhood      category
Year_Built         float64
Price              float64
dtype: object

In [17]:
neighborhood_dum = pd.get_dummies(house_data['Neighborhood'], prefix='Neighborhood')

In [18]:
house_data = pd.concat([house_data, neighborhood_dum], axis=1)

In [19]:
print(house_data)

      Rooms  Bathrooms  Square_Footage Neighborhood  Year_Built      Price  \
0  1.000000        1.0             800            1      1991.0  3000000.0
1  1.000000        2.0             900            1      2004.0  3500000.0
2  2.000000        1.0            1000            2      1994.0  4500000.0
3  2.000000        2.0            1200            1      2002.0  5000000.0
4  3.000000        2.0            1400            2      2003.0  6500000.0
5  3.000000        3.0            1500            2      1989.0  7000000.0
6  2.285714        2.0            1700            2         NaN  8000000.0
7  4.000000        2.0            2100            1      2012.0        NaN

   Neighborhood_1  Neighborhood_2
0               1               0
1               1               0
2               0               1
3               1               0
4               0               1
5               0               1
6               0               1
7               1               0

# Sklearn-ordinalencoding()

In [21]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OrdinalEncoder

In [22]:
a = {'Rooms': [1,1,2,2,3,3,np.nan, 4],
        'Bathrooms': [1,2,1,2,2,3,2, np.nan],
        'Square_Footage': [800, 900, 1000, 1200, 1400, 1500, 1700, 2100],
        'Neighborhood': ['rural','rural','urban','rural','urban','urban','urban','rural'],
        'Year_Built': [1991, 2004, 1994, 2002, 2003, 1989, np.nan, 2012],
        'Price': [3000000, 3500000, 4500000, 5000000, 6500000, 7000000, 8000000, np.nan]}

In [23]:
house=pd.DataFrame(a,index=[1,2,3,4,5,6,7,8])
encoder=OrdinalEncoder()
house["Rooms_encoded"]=encoder.fit_transform(house[['Rooms']])

In [24]:
print(house['Rooms_encoded'])

1    0.0
2    0.0
3    1.0
4    1.0
5    2.0
6    2.0
7    NaN
8    3.0
Name: Rooms_encoded, dtype: float64